### 1. Import the Library

In [1]:
# Import Pandas library, MySQL Connector driver to connect Python script to the MySQL database, moduleâ€™s Error class
import pandas as pd
import mysql.connector
from mysql.connector import Error

### 2. Create connection to Server

In [2]:
# Function that connects to MySQL database server and returns the connection object
def create_server_connection(host_name, user_name, db_pass):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            password = db_pass
        )
        print("MySQL Database Server connection successful")
    except Error as err:
        print(f"The error '{err}' occurred")
    
    return connection

In [3]:
# Root password for MySQL Server
db_pass = "Dragan16**"

# Name of the created database
db_name = "mysql_orders"

# Create connection to MySQL Server
connection = create_server_connection("localhost", "root", db_pass)

MySQL Database Server connection successful

### 3. Create new Database

In [4]:
# Function that creates MySQL database on server
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"The error '{err}' occurred")

In [5]:
# Define MySQL query to create database
create_database_query = "CREATE DATABASE mysql_orders"

In [6]:
# Call function that creates MySQL database on server
create_database(connection, create_database_query)

Database created successfully

### 4. Create connection to Database

In [7]:
# Function that connects to created database in MySQL database server and returns the connection object
def create_db_connection(host_name, user_name, db_pass, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            password = db_pass,
            database = db_name
        )
        print("MySQL Database connection successful")
    
    except Error as err:
        print(f"The error '{err}' occurred")
        
    return connection

### 5. Execute SQL Query

In [8]:
# Function that executes SQL query on MySQL database server
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as err:
        print(f"The error '{err}' occurred")

### 6. Create Table

In [9]:
# Create table into database
create_orders_table = """
CREATE TABLE IF NOT EXISTS orders(
    order_id INT PRIMARY KEY,
    customer_name VARCHAR(30) NOT NULL,
    product_name VARCHAR(30) NOT NULL,
    date_ordered DATE,
    quantity INT,
    unit_price FLOAT,
    phone_number VARCHAR(20)
);
"""

In [10]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute MySQL query
execute_query(connection, create_orders_table)

MySQL Database connection successful
Query executed successfully

### 7. Insert Records

In [11]:
# Insert data into column of table
insert_orders = """
INSERT INTO orders (order_id, customer_name, product_name, date_ordered, quantity, unit_price, phone_number)
VALUES (101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '6293720802'),
       (102, 'Josh', 'Books', '2019-02-10', 10, 12, '549398403'),
       (103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '2537498020'),
       (104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '9868850623'),
       (105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '857379648'),
       (106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '847473729');
"""

In [12]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute MySQL query
execute_query(connection, insert_orders)

MySQL Database connection successful
Query executed successfully

### 8. Read Query

In [13]:
# Function that select (read) records records
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"The error '{err}' occurred")

### 9. Select (Read) Records

In [14]:
# Select (Read) records from MySQL table
select_orders = """
SELECT *
FROM orders
"""

In [15]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute read query
results = read_query(connection, select_orders)

for result in results:
    print(result)

MySQL Database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293720802')
(102, 'Josh', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '549398403')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '2537498020')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '9868850623')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '857379648')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '847473729')

In [16]:
# Select (Read) records from MySQL table
select_orders = """
SELECT *
FROM orders
WHERE date_ordered < '2018-12-31'
"""

In [17]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute read query
results = read_query(connection, select_orders)

for result in results:
    print(result)

MySQL Database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293720802')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '9868850623')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '847473729')

In [18]:
# Select (Read) records from MySQL table
select_orders = """
SELECT customer_name, phone_number
FROM orders
ORDER BY unit_price DESC
"""

In [19]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute read query
results = read_query(connection, select_orders)

for result in results:
    print(result)

MySQL Database connection successful
('Steve', '6293720802')
('Danny', '847473729')
('Stacy', '2537498020')
('Maria', '857379648')
('Nancy', '9868850623')
('Josh', '549398403')

### 10. Update Records

In [20]:
# Update table
update_orders = """
UPDATE orders
SET unit_price = 45
WHERE order_id=103
"""

In [21]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute query
execute_query(connection, update_orders)

MySQL Database connection successful
Query executed successfully

In [22]:
# Select (Read) records from MySQL table
select_orders = """
SELECT *
FROM orders
"""

In [23]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute read query
results = read_query(connection, select_orders)

for result in results:
    print(result)

MySQL Database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293720802')
(102, 'Josh', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '549398403')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '2537498020')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '9868850623')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '857379648')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '847473729')

### 11. Delete Records

In [24]:
# Delete row from table
delete_orders = """
DELETE FROM orders
WHERE order_id = 105
"""

In [25]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute query
execute_query(connection, delete_orders)

MySQL Database connection successful
Query executed successfully

In [26]:
# Select (Read) records from MySQL table
select_orders = """
SELECT *
FROM orders
"""

In [27]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute read query
results = read_query(connection, select_orders)

for result in results:
    print(result)

MySQL Database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293720802')
(102, 'Josh', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '549398403')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '2537498020')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '9868850623')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '847473729')

### 12. Format output into Pandas DataFrame

In [28]:
# Create empty list
output_db = []

# Loop over the results
for result in results:
    result = list(result)
    output_db.append(result)

In [29]:
# Column names
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity", "unit_price", "phone_number"]

# Create Pandas DataFrame from database (SQL query) output
df = pd.DataFrame(output_db, columns = columns)

In [30]:
# Display the few top rows of Pandas DataFrame
df.head()

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,6293720802
1,102,Josh,Books,2019-02-10,10,12.0,549398403
2,103,Stacy,Trousers,2019-12-25,5,45.0,2537498020
3,104,Nancy,T-Shirts,2018-07-14,7,30.0,9868850623
4,106,Danny,Smart TV,2018-08-20,10,300.0,847473729

### 13. Drop Database

In [31]:
# Remove created database
remove_orders_database = """
DROP DATABASE mysql_orders
"""

In [32]:
# Create connection to MySQL database
connection = create_db_connection("localhost", "root", db_pass, db_name)

# Execute read query
results = read_query(connection, remove_orders_database)

MySQL Database connection successful